
1. Написать програмку, которая печатает
ваше имя на консоль.
Цели:
- познакомиться с выводом на консоль.

2. Написать програмку, которая печатает
ваше имя в одной строке и фамилию в другой строке
на консоль.
Цели:
- научиться копировать классы;
- давать классам новые названия;
- последовательность команд, каждая команда в новой строке.

3. Git add -> commit -> push
Цели:
- научиться добавлять файлы в Git (зелёные);
- научиться комитить изменения в Git;
- научиться пушить изменения в Git.

4. Git pull
Цели:
- научиться обновлять проект из репозитория.

5. Сложение двух чисел
int number1 = 100;
int number2 = 200;
result = number1 + number2;
System.out.println();
Цели:
- познакомиться с типом данных int
для представления целых чисел;
- познакомиться с понятием переменной;
- потренироваться в придумывании названия класса.

6. Арифметические операции над целыми числами - калькулятор
int number1 = 100;
int number2 = 200;
result = number1 +/-/*/: number2;
System.out.println();
Цели:
- познакомиться с операциями над целыми числами;
- познакомиться с понятием переменной;
- потренироваться в придумывании названия класса.

7. Арифметические операции над дробными числами - калькулятор
double number1 = 100;
doble number2 = 200;
result = number1 +/-/*/: number2;
System.out.println();
Цели:
- познакомиться с операциями над вещественными числами;
- познакомиться с типами данных double;
- потренироваться в придумывании названия класса.

8. Конкатенация строк
String firstName = "Vasja";
String lastName = "Pupkin";
String result = firstName + lastName;
System.out.println();
Цели:
- познакомиться с типом данных String;
- познакомиться с операцией конкатенации.

9. Задача "Площадь треугольника":
Напишите программу, которая запрашивает
у пользователя три стороны треугольника,
а затем вычисляет и выводит его площадь.
Цели:
- не знаю как расчитать площать треугольника, что делать?
- поиск формулы в Google;
- составление алгоритма решения задачи на словах!
- не знаю как запросить данные у пользователя
с консоли -> Goolge в помощь!
- формула Герона, вычисляем по частям;
- не знаю как в Java вычислить квадратный корень -> Google!


10. Задача "Перевод времени":
Напишите программу, которая запрашивает
у пользователя количество секунд и выводит
время в формате часы:минуты:секунды.
Например, если пользователь вводит 3665 секунд,
программа должна вывести 1:1:5.
Цели:
- придумать алгоритм решения;
- познакомиться с операцией деления без остатка (int / int).

11. Задача "Калькулятор BMI":
Напишите программу, которая запрашивает
у пользователя его вес (в килограммах) и рост
(в метрах), а затем вычисляет и выводит его
индекс массы тела (Body Mass Index, BMI).
Формула для расчета BMI: BMI = вес / (рост * рост).
Цели:
- изучение домена (предметной области),
что такое Body Mass Index, BMI?

12. Задача "Определение четности числа":
Напишите программу, которая запрашивает
у пользователя целое число и выводит сообщение,
указывающее, является ли число четным или нечетным.
Цели:
- познакомиться с операцией остаток от деления (%).
- познакомиться с оператором if () {}.

13. Задача "Конвертер температур":
Напишите программу, которая преобразует температуру
в градусах Цельсия в градусы Фаренгейта и Кельвина.
Запросите у пользователя температуру в градусах
Цельсия и выведите результат в градусах Фаренгейта
и в градусах Кельвина.
Цели:
- изучение предметной области, нахождение инфы в Google.

