package lv.javaguru.java1.student_alexey_kosmachev.lesson_7.homework.day_1;

//Найдите ошибку в программе и исправить её:
class ArrayLength2 {

    public static void main(String[] args) {
        int[] numbers = new int[3]; // добавить три единицы в длину
        System.out.println(numbers[0]);
        System.out.println(numbers[1]);
        System.out.println(numbers[2]);
    }

}
