package lv.javaguru.java1.student_alexey_kosmachev.lesson_7.homework.day_1;
//Найдите логическую ошибку в программе и исправить её:
class ArrayLength1 {

    public static void main(String[] args) {
        int[] numbers = new int[2];
        System.out.println(numbers[1]); // убрать отрицательное значение
    }
}
