package lv.javaguru.java1.student_alexey_kosmachev.lesson_7.homework.day_1;

//Найдите ошибку в программе и исправить её:
public class ArrayLength3 {

    public static void main(String[] args) {
        int[] numbers = new int[2];
        System.out.println(numbers.length); // убрать скобки после length
    }
}
