package lv.javaguru.java1.student_alexey_kosmachev.lesson_7.homework.day_2;

//Найдите синтаксическую ошибку в программе и исправьте её:
class ForLoopDefinition5 {

    public static void main(String[] args) {
        for (int i = 0; i < 10; i++) { //не хватало закрывающей скобки
            System.out.println(i);
        }
    }
}
