package lv.javaguru.java1.student_alexey_kosmachev.lesson_2.homework.day4;

//Команда System.out.println("text"); выводит указанный "text"
//на консоль, и переводит курсор на новую строку.
//
//Для того, что бы выводить текст на консоль без перевода курсора на
//новую строку можно воспользоваться командой
//    System.out.print("text");
//эта команда распечатает текст на консоль и оставит курсор в той же строке.
//
//Напишите программу, которая демонстрирует использование команды
//    System.out.print("text");
public class TekstVtojzeStroke {
    public static void main(String[]args) {
        System.out.print("Жить, как говорится, хорошо."); // Совмещаем логически связанный текст в одну строку.
        System.out.print(" А хорошо жить еще лучше.");
    }
}
