package lv.javaguru.java1.student_tatjana_grigorcaka.lesson_12.homework.day_3;

abstract class AbstractClass {

}

/*
    Напишите ответы на вопросы тут.

    Что такое абстрактный класс?
    Ваш ответ.
    -Абстрактным называется такой класс, экземпляр которого нельзя создать сам по себе – он служит основой для других классов. При объявлении такого класса в его определении ставится ключевое слово abstract.

    Можно ли создать экземпляр абстрактного класса в момент выполнения программы?
    Ваш ответ.
    -Aбстрактные классы могут содержать как абстрактные, так и неабстрактные методы, а также переменные экземпляров, конструкторы. Правда, напрямую инстанцировать абстрактные классы нельзя, а это означает, что их не получится напрямую использовать для создания объектов.
*/
